mikewang01/GOWATCH/ClingGo_NRF52/project/adapters/hw_spi.h
void hw_spi_disable(HW_SPI_ID id);
//=========================== CS handling function =============================

/**
 * \brief Set SPI CS low
 *
 * \param [in] id identifies SPI1 or SPI2
 *
 */
void hw_spi_set_cs_low(HW_SPI_ID id);

/**
 * \brief Set SPI CS high
 *
 * \param [in] id identifies SPI1 or SPI2
 *
 */
void hw_spi_set_cs_high(HW_SPI_ID id);

//=========================== FIFO control functions ===========================

/**
 * \brief Set SPI FIFO mode
 *
 * \param [in] id identifies SPI1 or SPI2
 * \param [in] mode SPI FIFO mode
 *
 */
void hw_spi_set_fifo_mode(HW_SPI_ID id, HW_SPI_FIFO mode);

/**
 * \brief Get SPI FIFO mode
 *
 * \param [in] id identifies SPI1 or SPI2
 *
 * \return currently selected SPI FIFO mode
 *
 */
HW_SPI_FIFO hw_spi_get_fifo_mode(HW_SPI_ID id);

/**
 * \brief Change SPI FIFO mode
 *
 * Unlike hw_spi_set_fifo_mode() it checks current FIFO mode and if mode is going to change
 * waits till all data were sent before changing mode.
 * If mode is same, registers are not touched and no waiting is performed.
 *
 * \param [in] id identifies SPI1 or SPI2
 * \param [in] mode SPI FIFO mode
 *
 * \return previously selected SPI FIFO mode
 *
 *  \sa hw_spi_set_fifo_mode
 *
 */
HW_SPI_FIFO hw_spi_change_fifo_mode(HW_SPI_ID id, HW_SPI_FIFO mode);



/**
 * \brief Set SPI priority
 *
 * \param [in] id identifies SPI1 or SPI2
 * \param [in] priority 0 = The SPI has low priority, the DMA request signals are reset
 *                          after the corresponding acknowledge,
 *                      1 = The SPI has high priority, DMA request signals remain active
 *                          until the FIFOS are filled/emptied, so the DMA holds the AHB bus
 *
 */
static inline void hw_spi_set_dma_priority(HW_SPI_ID id, uint8_t priority)
{
        //HW_SPI_REG_SETF(id, SPI_CTRL_REG1, SPI_PRIORITY, priority);
}

/**
 * \brief Get the currently set SPI priority
 *
 * \param [in] id identifies SPI1 or SPI2
 *
 * \return the currently set priority:
 *         0 = The SPI has low priority, the DMA request signals are reset
 *             after the corresponding acknowledge,
 *         1 = The SPI has high priority, DMA request signals remain active
 *             until the FIFOS are filled/emptied, so the DMA holds the AHB bus
 *
 */
static inline uint8_t hw_spi_get_dma_priority(HW_SPI_ID id)
{
        return 1;//HW_SPI_REG_GETF(id, SPI_CTRL_REG1, SPI_PRIORITY);
}

//=========================== Other functions ============================

/**
 * \brief Get SPI busy status
 *
 * \param [in] id identifies SPI1 or SPI2
 *
 * \return status of SPI BUSY bit:
 *         0 = The SPI is not busy with a transfer. This means that either
 *             no TX-data is available or that the transfers have been suspended
 *             due to a full RX-FIFO. The SPI interrupt bit can be used to
 *             distinguish between these situations,
 *         1 = The SPI is busy with a transfer
 *
 */
static inline uint8_t hw_spi_is_busy(HW_SPI_ID id)
{
        // Get the value of the SPI BUSY bit from the secondary SPI control register
        return 1;//HW_SPI_REG_GETF(id, SPI_CTRL_REG1, SPI_BUSY);
}

/**
 * \brief Wait till SPI is not busy
 *
 * \param [in] id identifies SPI1 or SPI2
 *
 *
 */
static inline void hw_spi_wait_while_busy(HW_SPI_ID id)
{
        while (hw_spi_is_busy(id)) {
        }
}

#endif /* dg_configUSE_HW_SPI */

#endif /* HW_SPI_H_ */

/**
 * \}
 * \}
 * \}
 */
